gorbukov/AsmEdit4/inf/STM32/MCU/STM32F4/PERIPH/RCC/rcc.inc
@GNU AS
@.CharSet=CP1251 (Cyrillic)
@.desc type=module
@ +------------------------------------------------------------------+
@ |                     Базовые константы RCC                        |
@ +------------------------------------------------------------------+
@.enddesc


.include "/src/inc/base.inc"

@.item AHB1PERIPH_BASE
.equ     RCC_BASE     , (AHB1PERIPH_BASE + 0x3800) @ Базовый адрес RCC
@.end

@.item RCC_BASE
.equ RCC_CR       , 0x00 @ RCC clock control register
.equ RCC_PLLCFGR  , 0x04 @ RCC PLL configuration register
.equ RCC_CFGR     , 0x08 @ RCC clock configuration register
.equ RCC_CIR      , 0x0C @ RCC clock interrupt register
.equ RCC_AHB1RSTR , 0x10 @ RCC AHB1 peripheral reset register
.equ RCC_AHB2RSTR , 0x14 @ RCC AHB2 peripheral reset register
.equ RCC_AHB3RSTR , 0x18 @ RCC AHB3 peripheral reset register
.equ RCC_APB1RSTR , 0x20 @ RCC APB1 peripheral reset register
.equ RCC_APB2RSTR , 0x24 @ RCC APB2 peripheral reset register
.equ RCC_AHB1ENR  , 0x30 @ RCC AHB1 peripheral clock register
.equ RCC_AHB2ENR  , 0x34 @ RCC AHB2 peripheral clock enable register
.equ RCC_AHB3ENR  , 0x38 @ RCC AHB3 peripheral clock enable register
.equ RCC_APB1ENR  , 0x40 @ RCC APB1 peripheral clock enable register
.equ RCC_APB2ENR  , 0x44 @ RCC APB1 peripheral clock enable register
.equ RCC_AHB1LPENR, 0x50 @ RCC AHB1 peripheral clock enable in low power mode register
.equ RCC_AHB2LPENR, 0x54 @ RCC AHB2 peripheral clock enable in low power mode register
.equ RCC_AHB3LPENR, 0x58 @ RCC AHB3 peripheral clock enable in low power mode register
.equ RCC_APB1LPENR, 0x60 @ RCC APB1 peripheral clock enable in low power mode register
.equ RCC_APB2LPENR, 0x64 @ RCC APB2 peripheral clock enabled in low power mode register
.equ RCC_BDCR     , 0x70 @ RCC Backup domain control register
.equ RCC_CSR      , 0x74 @ RCC clock control & status register
.equ RCC_SSCGR    , 0x80 @ RCC spread spectrum clock generation register
.equ RCC_PLLI2SCFGR     , 0x84 @ RCC PLLI2S configuration register
.equ RCC_PLLSAICFGR, 0x88 @ RCC PLL configuration register
.equ RCC_DCKCFGR  , 0x8C @ RCC Dedicated Clock Configuration Register
@.end

@.item RCC_CR
.equ RCC_CR_HSION              , 0x00000001 @ Bit 0 HSION: Internal high-speed clock enable
.equ RCC_CR_HSION_N            , 0
.equ RCC_CR_HSIRDY             , 0x00000002 @ Bit 1 HSIRDY: Internal high-speed clock ready flag
.equ RCC_CR_HSIRDY_N           , 1
.equ RCC_CR_HSITRIM_N          , 3 @ Bits 7:3 HSITRIM[4:0]: Internal high-speed clock trimming
.equ RCC_CR_HSICAL_N           , 8 @ Bits 15:8 HSICAL[7:0]: Internal high-speed clock calibration
.equ RCC_CR_HSEON              , 0x00010000 @ Bit 16 HSEON: HSE clock enable
.equ RCC_CR_HSEON_N            , 16
.equ RCC_CR_HSERDY             , 0x00020000 @ Bit 17 HSERDY: HSE clock ready flag
.equ RCC_CR_HSERDY_N           , 17
.equ RCC_CR_HSEBYP             , 0x00040000 @ Bit 18 HSEBYP: HSE clock bypass
.equ RCC_CR_HSEBYP_N           , 18
.equ RCC_CR_CSSON              , 0x00080000 @ Bit 19 CSSON: Clock security system enable
.equ RCC_CR_CSSON_N            , 19
.equ RCC_CR_PLLON              , 0x01000000 @ Bit 24 PLLON: Main PLL (PLL) enable
.equ RCC_CR_PLLON_N            , 24
.equ RCC_CR_PLLRDY             , 0x02000000 @ Bit 25 PLLRDY: Main PLL (PLL) clock ready flag
.equ RCC_CR_PLLRDY_N           , 25
.equ RCC_CR_PLLI2SON           , 0x04000000 @ Bit 26 PLLI2SON: PLLI2S enable
.equ RCC_CR_PLLI2SON_N         , 26
.equ RCC_CR_PLLI2SRDY          , 0x08000000 @ Bit 27 PLLI2SRDY: PLLI2S clock ready flag
.equ RCC_CR_PLLI2SRDY_N        , 27
.equ RCC_CR_PLLSAION           , 0x10000000 @ Bit 28 PLLSAION: PLLSAI enable
.equ RCC_CR_PLLSAION_N         , 28
.equ RCC_CR_PLLSAIRDY          , 0x20000000 @ Bit 29 PLLSAIRDY: PLLSAI clock ready flag
.equ RCC_CR_PLLSAIRDY_N        , 29
@.end

@.item RCC_PLLCFGR
.equ  RCC_PLLCFGR_PLLM_N       , 0 @ Bits 5:0 PLLM: Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock
.equ  RCC_PLLCFGR_PLLN_N       , 6 @ Bits 14:6 PLLN: Main PLL (PLL) multiplication factor for VCO
.equ  RCC_PLLCFGR_PLLP_N       , 16 @ Bits 17:16 PLLP: Main PLL (PLL) division factor for main system clock
.equ  RCC_PLLCFGR_PLLP_2       , 0x00000000
.equ  RCC_PLLCFGR_PLLP_4       , 0x00010000
.equ  RCC_PLLCFGR_PLLP_6       , 0x00020000
.equ  RCC_PLLCFGR_PLLP_8       , 0x00030000
.equ  RCC_PLLCFGR_PLLSRC_N     , 22 @ Bit 22 PLLSRC: Main PLL(PLL) and audio PLL (PLLI2S) entry clock source
.equ  RCC_PLLCFGR_PLLSRC_HSE   , 0x00400000
.equ  RCC_PLLCFGR_PLLSRC_HSI   , 0x00000000
.equ  RCC_PLLCFGR_PLLQ_N       , 24 @ Bits 27:24 PLLQ: Main PLL (PLL) division factor for USB OTG FS, SDIO and random number generator clocks
.equ  RCC_PLLCFGR_PLLQ_2       , 2<<24
.equ  RCC_PLLCFGR_PLLQ_3       , 3<<24
.equ  RCC_PLLCFGR_PLLQ_4       , 4<<24
.equ  RCC_PLLCFGR_PLLQ_5       , 5<<24
.equ  RCC_PLLCFGR_PLLQ_6       , 6<<24
.equ  RCC_PLLCFGR_PLLQ_7       , 7<<24
.equ  RCC_PLLCFGR_PLLQ_8       , 8<<24
.equ  RCC_PLLCFGR_PLLQ_9       , 9<<24
.equ  RCC_PLLCFGR_PLLQ_10      , 10<<24
.equ  RCC_PLLCFGR_PLLQ_11      , 11<<24
.equ  RCC_PLLCFGR_PLLQ_12      , 12<<24
.equ  RCC_PLLCFGR_PLLQ_13      , 13<<24
.equ  RCC_PLLCFGR_PLLQ_14      , 14<<24
.equ  RCC_PLLCFGR_PLLQ_15      , 15<<24
@.end

@.item RCC_CFGR
.equ  RCC_CFGR_SW_HSI          , 0x00000000 @ Bits 1:0 SW: System clock switch
.equ  RCC_CFGR_SW_HSE          , 0x00000001
.equ  RCC_CFGR_SW_PLL          , 0x00000002
.equ  RCC_CFGR_SWS_N           , 2 @ Bits 3:2 SWS: System clock switch status
.equ  RCC_CFGR_SWS_HSI         , 0x00
.equ  RCC_CFGR_SWS_HSE         , 0x04
.equ  RCC_CFGR_SWS_PLL         , 0x08
.equ  RCC_CFGR_HPRE_DIV1       , 0x00000000 @ Bits 7:4 HPRE: AHB prescaler
.equ  RCC_CFGR_HPRE_DIV2       , 0x00000080
.equ  RCC_CFGR_HPRE_DIV4       , 0x00000090
.equ  RCC_CFGR_HPRE_DIV8       , 0x000000A0
.equ  RCC_CFGR_HPRE_DIV16      , 0x000000B0
.equ  RCC_CFGR_HPRE_DIV64      , 0x000000C0
.equ  RCC_CFGR_HPRE_DIV128     , 0x000000D0
.equ  RCC_CFGR_HPRE_DIV256     , 0x000000E0
.equ  RCC_CFGR_HPRE_DIV512     , 0x000000F0
.equ  RCC_CFGR_PPRE1_DIV1      , 0x00000000 @ Bits 12:10 PPRE1: APB Low speed prescaler (APB1)
.equ  RCC_CFGR_PPRE1_DIV2      , 0x00001000
.equ  RCC_CFGR_PPRE1_DIV4      , 0x00001400
.equ  RCC_CFGR_PPRE1_DIV8      , 0x00001800
.equ  RCC_CFGR_PPRE1_DIV16     , 0x00001C00
.equ  RCC_CFGR_PPRE2_DIV1      , 0x00000000 @ Bits 15:13 PPRE2: APB high-speed prescaler (APB2)
.equ  RCC_CFGR_PPRE2_DIV2      , 0x00008000
.equ  RCC_CFGR_PPRE2_DIV4      , 0x0000A000
.equ  RCC_CFGR_PPRE2_DIV8      , 0x0000C000
.equ  RCC_CFGR_PPRE2_DIV16     , 0x0000E000
.equ  RCC_CFGR_RTCPRE_N        , 16 @ Bits 20:16 RTCPRE: HSE division factor for RTC clock
.equ  RCC_CFGR_MCO1_HSI        , 0x00 @ Bits 22:21 MCO1: Microcontroller clock output 1
.equ  RCC_CFGR_MCO1_LSE        , 0x01<<21
.equ  RCC_CFGR_MCO1_HSE        , 0x02<<21
.equ  RCC_CFGR_MCO1_PLL        , 0x03<<21
.equ  RCC_CFGR_I2SSRC          , 0x00800000 @ Bit 23 I2SSRC: I2S clock selection
.equ  RCC_CFGR_MCO1PRE_DIV1    , 0x00 @ Bits 24:26 MCO1PRE: MCO1 prescaler
.equ  RCC_CFGR_MCO1PRE_DIV2    , 4<<24
.equ  RCC_CFGR_MCO1PRE_DIV3    , 5<<24
.equ  RCC_CFGR_MCO1PRE_DIV4    , 6<<24
.equ  RCC_CFGR_MCO1PRE_DIV5    , 7<<24
.equ  RCC_CFGR_MCO1PRE_N       , 24
.equ  RCC_CFGR_MCO2PRE_DIV1    , 0x00 @ Bits 27:29 MCO2PRE: MCO2 prescaler
.equ  RCC_CFGR_MCO2PRE_DIV2    , 4<<27
.equ  RCC_CFGR_MCO2PRE_DIV3    , 5<<27
.equ  RCC_CFGR_MCO2PRE_DIV4    , 6<<27
.equ  RCC_CFGR_MCO2PRE_DIV5    , 7<<27
.equ  RCC_CFGR_MCO2PRE_N       , 27
.equ  RCC_CFGR_MCO2_SYSCLK     , 0x00 @ Bits 31:30 MCO2[1:0]: Microcontroller clock output 2
.equ  RCC_CFGR_MCO2_PLLI2S     , 1<<30
.equ  RCC_CFGR_MCO2_HSE        , 2<<30
.equ  RCC_CFGR_MCO2_PLL        , 3<<30
.equ  RCC_CFGR_MCO2_N          , 30
@.end

@.item RCC_CIR
.equ  RCC_CIR_LSIRDYF_N           , 0 @ Bit 0 LSIRDYF: LSI ready interrupt flag
.equ  RCC_CIR_LSIRDYF            , 0x00000001
.equ  RCC_CIR_LSERDYF_N          , 1 @ Bit 1 LSERDYF: LSE ready interrupt flag
.equ  RCC_CIR_LSERDYF            , 0x00000002
.equ  RCC_CIR_HSIRDYF_N          , 2 @ Bit 2 HSIRDYF: HSI ready interrupt flag
.equ  RCC_CIR_HSIRDYF            , 0x00000004
.equ  RCC_CIR_HSERDYF_N          , 3 @ Bit 3 HSERDYF: HSE ready interrupt flag
.equ  RCC_CIR_HSERDYF            , 0x00000008
.equ  RCC_CIR_PLLRDYF_N          , 4 @ Bit 4 PLLRDYF: Main PLL (PLL) ready interrupt flag
.equ  RCC_CIR_PLLRDYF            , 0x00000010
.equ  RCC_CIR_PLLI2SRDYF_N       , 5 @ Bit 5 PLLI2SRDYF: PLLI2S ready interrupt flag
.equ  RCC_CIR_PLLI2SRDYF         , 0x00000020
.equ  RCC_CIR_PLLSAIRDYF_N      , 6 @ Bit 6 PLLSAIRDYF: PLLSAI Ready Interrupt flag
.equ  RCC_CIR_PLLSAIRDYF         , 0x00000040
.equ  RCC_CIR_CSSF_N             , 7 @ Bit 7 CSSF: Clock security system interrupt flag
.equ  RCC_CIR_CSSF               , 0x00000080
.equ  RCC_CIR_LSIRDYIE_N         , 8 @ Bit 8 LSIRDYIE: LSI ready interrupt enable
.equ  RCC_CIR_LSIRDYIE           , 0x00000100
.equ  RCC_CIR_LSERDYIE_N         , 9 @ Bit 9 LSERDYIE: LSE ready interrupt enable
.equ  RCC_CIR_LSERDYIE           , 0x00000200
.equ  RCC_CIR_HSIRDYIE_N         , 10 @ Bit 10 HSIRDYIE: HSI ready interrupt enable
.equ  RCC_CIR_HSIRDYIE           , 0x00000400
.equ  RCC_CIR_HSERDYIE_N         , 11 @ Bit 11 HSERDYIE: HSE ready interrupt enable
.equ  RCC_CIR_HSERDYIE           , 0x00000800
.equ  RCC_CIR_PLLRDYIE_N         , 12 @ Bit 12 PLLRDYIE: Main PLL (PLL) ready interrupt enable
.equ  RCC_CIR_PLLRDYIE           , 0x00001000
.equ  RCC_CIR_PLLI2SRDYIE_N      , 13 @ Bit 13 PLLI2SRDYIE: PLLI2S ready interrupt enable
.equ  RCC_CIR_PLLI2SRDYIE        , 0x00002000
.equ  RCC_CIR_LSIRDYC_N          , 14 @ Bit 14 PLLSAIRDYIE: PLLSAI Ready Interrupt Enable
.equ  RCC_CIR_LSIRDYC            , 0x00004000
.equ  RCC_CIR_LSERDYC_N          , 16 @ Bit 16 LSIRDYC: LSI ready interrupt clear
.equ  RCC_CIR_LSERDYC            , 0x00010000
.equ  RCC_CIR_HSIRDYC_N          , 17 @ Bit 17 LSERDYC: LSE ready interrupt clear
.equ  RCC_CIR_HSIRDYC            , 0x00020000
.equ  RCC_CIR_HSERDYC_N          , 18 @ Bit 18 HSIRDYC: HSI ready interrupt clear
.equ  RCC_CIR_HSERDYC            , 0x00040000
.equ  RCC_CIR_PLLRDYC_N          , 19 @ Bit 19 HSERDYC: HSE ready interrupt clear
.equ  RCC_CIR_PLLRDYC            , 0x00080000
.equ  RCC_CIR_PLLI2SRDYC_N       , 20 @ Bit 20 PLLRDYC: Main PLL(PLL) ready interrupt clear
.equ  RCC_CIR_PLLI2SRDYC         , 0x00100000
.equ  RCC_CIR_PLLI2SRDYC_N       , 21 @ Bit 21 PLLI2SRDYC: PLLI2S ready interrupt clear
.equ  RCC_CIR_PLLI2SRDYC         , 0x00200000
.equ  RCC_CIR_PLLSAIRDYC_N       , 22 @ Bit 22 PLLSAIRDYC: PLLSAI Ready Interrupt Clear
.equ  RCC_CIR_PLLSAIRDYC         , 0x00400000
.equ  RCC_CIR_CSSC_N             , 23 @ Bit 23 CSSC: Clock security system interrupt clear
.equ  RCC_CIR_CSSC               , 0x00800000
@.end

@.item RCC_AHB1RSTR
.equ  RCC_AHB1RSTR_GPIOARST      ,0x00000001
.equ  RCC_AHB1RSTR_GPIOBRST      ,0x00000002
.equ  RCC_AHB1RSTR_GPIOCRST      ,0x00000004
.equ  RCC_AHB1RSTR_GPIODRST      ,0x00000008
.equ  RCC_AHB1RSTR_GPIOERST      ,0x00000010
.equ  RCC_AHB1RSTR_GPIOFRST      ,0x00000020
.equ  RCC_AHB1RSTR_GPIOGRST      ,0x00000040
.equ  RCC_AHB1RSTR_GPIOHRST      ,0x00000080
.equ  RCC_AHB1RSTR_GPIOIRST      ,0x00000100
.equ  RCC_AHB1RSTR_CRCRST        ,0x00001000
.equ  RCC_AHB1RSTR_DMA1RST       ,0x00200000
.equ  RCC_AHB1RSTR_DMA2RST       ,0x00400000
.equ  RCC_AHB1RSTR_ETHMACRST     ,0x02000000
.equ  RCC_AHB1RSTR_OTGHRST       ,0x10000000
@.end

@.item RCC_AHB2RSTR
.equ  RCC_AHB2RSTR_DCMIRST       ,0x00000001
.equ  RCC_AHB2RSTR_CRYPRST       ,0x00000010
.equ  RCC_AHB2RSTR_HSAHRST       ,0x00000020
.equ  RCC_AHB2RSTR_RNGRST        ,0x00000040
.equ  RCC_AHB2RSTR_OTGFSRST      ,0x00000080
@.end

@.item RCC_AHB3RSTR
.equ  RCC_AHB3RSTR_FSMCRST       ,0x00000001
@.end

