gorbukov/AsmEdit4/inf/STM32/MCU/STM32F4/PERIPH/RCC/rcc.inc
@.item RCC_APB1RSTR
.equ  RCC_APB1RSTR_TIM2RST       ,0x00000001
.equ  RCC_APB1RSTR_TIM3RST       ,0x00000002
.equ  RCC_APB1RSTR_TIM4RST       ,0x00000004
.equ  RCC_APB1RSTR_TIM5RST       ,0x00000008
.equ  RCC_APB1RSTR_TIM6RST       ,0x00000010
.equ  RCC_APB1RSTR_TIM7RST       ,0x00000020
.equ  RCC_APB1RSTR_TIM12RST      ,0x00000040
.equ  RCC_APB1RSTR_TIM13RST      ,0x00000080
.equ  RCC_APB1RSTR_TIM14RST      ,0x00000100
.equ  RCC_APB1RSTR_WWDGEN        ,0x00000800
.equ  RCC_APB1RSTR_SPI2RST       ,0x00008000
.equ  RCC_APB1RSTR_SPI3RST       ,0x00010000
.equ  RCC_APB1RSTR_USART2RST     ,0x00020000
.equ  RCC_APB1RSTR_USART3RST     ,0x00040000
.equ  RCC_APB1RSTR_UART4RST      ,0x00080000
.equ  RCC_APB1RSTR_UART5RST      ,0x00100000
.equ  RCC_APB1RSTR_I2C1RST       ,0x00200000
.equ  RCC_APB1RSTR_I2C2RST       ,0x00400000
.equ  RCC_APB1RSTR_I2C3RST       ,0x00800000
.equ  RCC_APB1RSTR_CAN1RST       ,0x02000000
.equ  RCC_APB1RSTR_CAN2RST       ,0x04000000
.equ  RCC_APB1RSTR_PWRRST        ,0x10000000
.equ  RCC_APB1RSTR_DACRST        ,0x20000000
@.end

@.item RCC_APB2RSTR
.equ  RCC_APB2RSTR_TIM1RST       ,0x00000001
.equ  RCC_APB2RSTR_TIM8RST       ,0x00000002
.equ  RCC_APB2RSTR_USART1RST     ,0x00000010
.equ  RCC_APB2RSTR_USART6RST     ,0x00000020
.equ  RCC_APB2RSTR_ADCRST        ,0x00000100
.equ  RCC_APB2RSTR_SDIORST       ,0x00000800
.equ  RCC_APB2RSTR_SPI1RST       ,0x00001000
.equ  RCC_APB2RSTR_SYSCFGRST     ,0x00004000
.equ  RCC_APB2RSTR_TIM9RST       ,0x00010000
.equ  RCC_APB2RSTR_TIM10RST      ,0x00020000
.equ  RCC_APB2RSTR_TIM11RST      ,0x00040000
@.end

@.item RCC_AHB1ENR
.equ  RCC_AHB1ENR_GPIOAEN        ,0x00000001 @ Bit 0 GPIOAEN: IO port A clock enable
.equ  RCC_AHB1ENR_GPIOAEN_N      ,0x00
.equ  RCC_AHB1ENR_GPIOBEN        ,0x00000002 @ Bit 1 GPIOBEN: IO port B clock enable
.equ  RCC_AHB1ENR_GPIOBEN_N      ,0x01
.equ  RCC_AHB1ENR_GPIOCEN        ,0x00000004 @ Bit 2 GPIOCEN: IO port C clock enable
.equ  RCC_AHB1ENR_GPIOCEN_N      ,0x02
.equ  RCC_AHB1ENR_GPIODEN        ,0x00000008 @ Bit 3 GPIODEN: IO port D clock enable
.equ  RCC_AHB1ENR_GPIODEN_N      ,0x03
.equ  RCC_AHB1ENR_GPIOEEN        ,0x00000010 @ Bit 4 GPIOEEN: IO port E clock enable
.equ  RCC_AHB1ENR_GPIOEEN_N      ,0x04
.equ  RCC_AHB1ENR_GPIOFEN_N      ,0x05 @ Bit 5 GPIOFEN: IO port F clock enable
.equ  RCC_AHB1ENR_GPIOFEN        ,0x00000020
.equ  RCC_AHB1ENR_GPIOGEN_N      ,0x06 @ Bit 6 GPIOGEN: IO port G clock enable
.equ  RCC_AHB1ENR_GPIOGEN        ,0x00000040
.equ  RCC_AHB1ENR_GPIOHEN_N      ,0x07 @ Bit 7 GPIOHEN: IO port H clock enable
.equ  RCC_AHB1ENR_GPIOHEN        ,0x00000080
.equ  RCC_AHB1ENR_GPIOIEN_N      ,0x08 @ Bit 8 GPIOIEN: IO port I clock enable
.equ  RCC_AHB1ENR_GPIOIEN        ,0x00000100
.equ  RCC_AHB1ENR_GPIOJEN_N      ,0x09 @ Bit 9 GPIOJEN: IO port J clock enable
.equ  RCC_AHB1ENR_GPIOJEN        ,0x00000200
.equ  RCC_AHB1ENR_GPIOKEN_N      ,10 @ Bit 10 GPIOKEN: IO port J clock enable
.equ  RCC_AHB1ENR_GPIOKEN        ,0x00000400
.equ  RCC_AHB1ENR_CRCEN_N        ,12 @ Bit 12 CRCEN: CRC clock enable
.equ  RCC_AHB1ENR_CRCEN          ,0x00001000
.equ  RCC_AHB1ENR_BKPSRAMEN_N    ,18 @ Bit 18 BKPSRAMEN: Backup SRAM interface clock enable
.equ  RCC_AHB1ENR_BKPSRAMEN      ,0x00040000
.equ  RCC_AHB1ENR_CCMDATARAMEN_N ,20 @ Bit 20 CCMDATARAMEN: CCM data RAM clock enable
.equ  RCC_AHB1ENR_CCMDATARAMEN   ,0x00100000
.equ  RCC_AHB1ENR_DMA1EN_N       ,21 @ Bit 21 DMA1EN: DMA1 clock enable
.equ  RCC_AHB1ENR_DMA1EN         ,0x00200000
.equ  RCC_AHB1ENR_DMA2EN_N       ,22 @ Bit 22 DMA2EN: DMA2 clock enable
.equ  RCC_AHB1ENR_DMA2EN         ,0x00400000
.equ  RCC_AHB1ENR_DMA2DEN_N      ,23 @ Bit 23 DMA2DEN: DMA2D clock enable
.equ  RCC_AHB1ENR_DMA2DEN        ,0x00800000
.equ  RCC_AHB1ENR_ETHMACEN_N     ,25 @ Bit 25 ETHMACEN: Ethernet MAC clock enable
.equ  RCC_AHB1ENR_ETHMACEN       ,0x02000000
.equ  RCC_AHB1ENR_ETHMACTXEN_N   ,26 @ Bit 26 ETHMACTXEN: Ethernet Transmission clock enable
.equ  RCC_AHB1ENR_ETHMACTXEN     ,0x04000000
.equ  RCC_AHB1ENR_ETHMACRXEN_N   ,27 @ Bit 27 ETHMACRXEN: Ethernet Reception clock enable
.equ  RCC_AHB1ENR_ETHMACRXEN     ,0x08000000
.equ  RCC_AHB1ENR_ETHMACPTPEN_N  ,28 @ Bit 28 ETHMACPTPEN: Ethernet PTP clock enable
.equ  RCC_AHB1ENR_ETHMACPTPEN    ,0x10000000
.equ  RCC_AHB1ENR_OTGHSEN_N      ,29 @ Bit 29 OTGHSEN: USB OTG HS clock enable
.equ  RCC_AHB1ENR_OTGHSEN        ,0x20000000
.equ  RCC_AHB1ENR_OTGHSULPIEN_N  ,30 @ Bit 30 OTGHSULPIEN: USB OTG HSULPI clock enable
.equ  RCC_AHB1ENR_OTGHSULPIEN    ,0x40000000
@.end

@.item RCC_AHB2ENR
.equ  RCC_AHB2ENR_DCMIEN_N       , 0 @ Bit 0 DCMIEN: Camera interface enable
.equ  RCC_AHB2ENR_DCMIEN         ,0x00000001
.equ  RCC_AHB2ENR_CRYPEN_N       , 4 @ Bit 4 CRYPEN: Cryptographic modules clock enable
.equ  RCC_AHB2ENR_CRYPEN         ,0x00000010
.equ  RCC_AHB2ENR_HASHEN_N       , 5 @ Bit 5 HASHEN: Hash modules clock enable
.equ  RCC_AHB2ENR_HASHEN         ,0x00000020
.equ  RCC_AHB2ENR_RNGEN_N        , 6 @ Bit 6 RNGEN: Random number generator clock enable
.equ  RCC_AHB2ENR_RNGEN          ,0x00000040
.equ  RCC_AHB2ENR_OTGFSEN_N      , 7 @ Bit 7 OTGFSEN: USB OTG FS clock enable
.equ  RCC_AHB2ENR_OTGFSEN        ,0x00000080
@.end

@.item RCC_AHB3ENR
.equ  RCC_AHB3ENR_FSMCEN_N       , 0 @ Bit 0 FMCEN: Flexible memory controller module clock enable
.equ  RCC_AHB3ENR_FSMCEN         ,0x00000001
@.end

@.item RCC_APB1ENR
.equ  RCC_APB1ENR_TIM2EN_N       , 0 @ Bit 0 TIM2EN: TIM2 clock enable
.equ  RCC_APB1ENR_TIM2EN         ,0x00000001
.equ  RCC_APB1ENR_TIM3EN_N       , 1 @ Bit 1 TIM3EN: TIM3 clock enable
.equ  RCC_APB1ENR_TIM3EN         ,0x00000002
.equ  RCC_APB1ENR_TIM4EN_N       , 2 @ Bit 2 TIM4EN: TIM4 clock enable
.equ  RCC_APB1ENR_TIM4EN         ,0x00000004
.equ  RCC_APB1ENR_TIM5EN_N       , 3 @ Bit 3 TIM5EN: TIM5 clock enable
.equ  RCC_APB1ENR_TIM5EN         ,0x00000008
.equ  RCC_APB1ENR_TIM6EN_N       , 4 @ Bit 4 TIM6EN: TIM6 clock enable
.equ  RCC_APB1ENR_TIM6EN         ,0x00000010
.equ  RCC_APB1ENR_TIM7EN_N       , 5 @ Bit 5 TIM7EN: TIM7 clock enable
.equ  RCC_APB1ENR_TIM7EN         ,0x00000020
.equ  RCC_APB1ENR_TIM12EN_N      , 6 @ Bit 6 TIM12EN: TIM12 clock enable
.equ  RCC_APB1ENR_TIM12EN        ,0x00000040
.equ  RCC_APB1ENR_TIM13EN_N      , 7 @ Bit 7 TIM13EN: TIM13 clock enable
.equ  RCC_APB1ENR_TIM13EN        ,0x00000080
.equ  RCC_APB1ENR_TIM14EN_N      , 8 @ Bit 8 TIM14EN: TIM14 clock enable
.equ  RCC_APB1ENR_TIM14EN        ,0x00000100
.equ  RCC_APB1ENR_WWDGEN_N       , 11 @ Bit 11 WWDGEN: Window watchdog clock enable
.equ  RCC_APB1ENR_WWDGEN         ,0x00000800
.equ  RCC_APB1ENR_SPI2EN_N       , 14 @ Bit 14 SPI2EN: SPI2 clock enable
.equ  RCC_APB1ENR_SPI2EN         ,0x00004000
.equ  RCC_APB1ENR_SPI3EN_N       , 15 @ Bit 15 SPI3EN: SPI3 clock enable
.equ  RCC_APB1ENR_SPI3EN         ,0x00008000
.equ  RCC_APB1ENR_USART2EN_N     , 17 @ Bit 17 USART2EN: USART2 clock enable
.equ  RCC_APB1ENR_USART2EN       ,0x00020000
.equ  RCC_APB1ENR_USART3EN_N     , 18 @ Bit 18 USART3EN: USART3 clock enable
.equ  RCC_APB1ENR_USART3EN       ,0x00040000
.equ  RCC_APB1ENR_UART4EN_N      , 19 @ Bit 19 UART4EN: UART4 clock enable
.equ  RCC_APB1ENR_UART4EN        ,0x00080000
.equ  RCC_APB1ENR_UART5EN_N      , 20 @ Bit 20 UART5EN: UART5 clock enable
.equ  RCC_APB1ENR_UART5EN        ,0x00100000
.equ  RCC_APB1ENR_I2C1EN_N       , 21 @ Bit 21 I2C1EN: I2C1 clock enable
.equ  RCC_APB1ENR_I2C1EN         ,0x00200000
.equ  RCC_APB1ENR_I2C2EN_N       , 22 @ Bit 22 I2C2EN: I2C2 clock enable
.equ  RCC_APB1ENR_I2C2EN         ,0x00400000
.equ  RCC_APB1ENR_I2C3EN_N       , 23 @ Bit 23 I2C3EN: I2C3 clock enable
.equ  RCC_APB1ENR_I2C3EN         ,0x00800000
.equ  RCC_APB1ENR_CAN1EN_N       , 25 @ Bit 25 CAN1EN: CAN 1 clock enable
.equ  RCC_APB1ENR_CAN1EN         ,0x02000000
.equ  RCC_APB1ENR_CAN2EN_N       , 26 @ Bit 26 CAN2EN: CAN 2 clock enable
.equ  RCC_APB1ENR_CAN2EN         ,0x04000000
.equ  RCC_APB1ENR_PWREN_N        , 28 @ Bit 28 PWREN: PWR clock enable
.equ  RCC_APB1ENR_PWREN          ,0x10000000
.equ  RCC_APB1ENR_DACEN_N        , 29 @ Bit 29 DACEN: DAC interface clock enable
.equ  RCC_APB1ENR_DACEN          ,0x20000000
.equ  RCC_APB1ENR_UART7EN_N      , 30 @ Bit 30 UART7EN: UART7 clock enable
.equ  RCC_APB1ENR_UART7EN        ,0x40000000
.equ  RCC_APB1ENR_UART8EN_N      , 31 @ Bit 31 UART8EN: UART8 clock enable
.equ  RCC_APB1ENR_UART8EN        ,0x80000000
@.end

