gorbukov/AsmEdit4/inf/STM32/MCU/STM32F4/PERIPH/RCC/rcc.inc
@.item RCC_APB2ENR
.equ  RCC_APB2ENR_TIM1EN_N       , 0 @ Bit 0 TIM1EN: TIM1 clock enable
.equ  RCC_APB2ENR_TIM1EN         ,0x00000001
.equ  RCC_APB2ENR_TIM8EN_N       , 1 @ Bit 1 TIM8EN: TIM8 clock enable
.equ  RCC_APB2ENR_TIM8EN         ,0x00000002
.equ  RCC_APB2ENR_USART1EN_N     , 4 @ Bit 4 USART1EN: USART1 clock enable
.equ  RCC_APB2ENR_USART1EN       ,0x00000010
.equ  RCC_APB2ENR_USART6EN_N     , 5 @ Bit 5 USART6EN: USART6 clock enable
.equ  RCC_APB2ENR_USART6EN       ,0x00000020
.equ  RCC_APB2ENR_ADC1EN_N       , 8 @ Bit 8 ADC1EN: ADC1 clock enable
.equ  RCC_APB2ENR_ADC1EN         ,0x00000100
.equ  RCC_APB2ENR_ADC2EN_N       , 9 @ Bit 9 ADC2EN: ADC2 clock enable
.equ  RCC_APB2ENR_ADC2EN         ,0x00000200
.equ  RCC_APB2ENR_ADC3EN_N       , 10 @ Bit 10 ADC3EN: ADC3 clock enable
.equ  RCC_APB2ENR_ADC3EN         ,0x00000400
.equ  RCC_APB2ENR_SDIOEN_N       , 11 @ Bit 11 SDIOEN: SDIO clock enable
.equ  RCC_APB2ENR_SDIOEN         ,0x00000800
.equ  RCC_APB2ENR_SPI1EN_N       , 12 @ Bit 12 SPI1EN: SPI1 clock enable
.equ  RCC_APB2ENR_SPI1EN         ,0x00001000
.equ  RCC_APB2ENR_SPI4EN_N       , 13 @ Bit 13 SPI4EN: SPI4 clock enable
.equ  RCC_APB2ENR_SPI4EN         ,0x00002000
.equ  RCC_APB2ENR_SYSCFGEN_N     , 14 @ Bit 14 SYSCFGEN: System configuration controller clock enable
.equ  RCC_APB2ENR_SYSCFGEN       ,0x00004000
.equ  RCC_APB2ENR_TIM9EN_N       , 16 @ Bit 16 TIM9EN: TIM9 clock enable
.equ  RCC_APB2ENR_TIM9EN         ,0x00010000
.equ  RCC_APB2ENR_TIM10EN_N      , 17 @ Bit 17 TIM10EN: TIM10 clock enable
.equ  RCC_APB2ENR_TIM10EN        ,0x00020000
.equ  RCC_APB2ENR_TIM11EN_N      , 18 @ Bit 18 TIM11EN: TIM11 clock enable
.equ  RCC_APB2ENR_TIM11EN        ,0x00040000
.equ  RCC_APB2ENR_SPI5EN_N       , 20 @ Bit 20 SPI5EN: SPI5 clock enable
.equ  RCC_APB2ENR_SPI5EN         ,0x00100000
.equ  RCC_APB2ENR_SPI6EN_N       , 21 @ Bit 21 SPI6EN: SPI6 clock enable
.equ  RCC_APB2ENR_SPI6EN         ,0x00200000
.equ  RCC_APB2ENR_SAI1EN_N       , 22 @ Bit 22 SAI1EN: SAI1 clock enable
.equ  RCC_APB2ENR_SAI1EN         ,0x00400000
.equ  RCC_APB2ENR_LTDCEN_N       , 26 @ Bit 26 LTDCEN: LTDC clock enable
.equ  RCC_APB2ENR_LTDCEN         ,0x04000000
@.end

@.item RCC_AHB1LPENR
.equ  RCC_AHB1LPENR_GPIOALPEN_N  , 0 @ Bit 0 GPIOALPEN: IO port A clock enable during sleep mode
.equ  RCC_AHB1LPENR_GPIOALPEN    ,0x00000001
.equ  RCC_AHB1LPENR_GPIOBLPEN_N  , 1 @ Bit 1 GPIOBLPEN: IO port B clock enable during Sleep mode
.equ  RCC_AHB1LPENR_GPIOBLPEN    ,0x00000002
.equ  RCC_AHB1LPENR_GPIOCLPEN_N  , 2 @ Bit 2 GPIOCLPEN: IO port C clock enable during Sleep mode
.equ  RCC_AHB1LPENR_GPIOCLPEN    ,0x00000004
.equ  RCC_AHB1LPENR_GPIODLPEN_N  , 3 @ Bit 3 GPIODLPEN: IO port D clock enable during Sleep mode
.equ  RCC_AHB1LPENR_GPIODLPEN    ,0x00000008
.equ  RCC_AHB1LPENR_GPIOELPEN_N  , 4 @ Bit 4 GPIOELPEN: IO port E clock enable during Sleep mode
.equ  RCC_AHB1LPENR_GPIOELPEN    ,0x00000010
.equ  RCC_AHB1LPENR_GPIOFLPEN_N  , 5 @ Bit 5 GPIOFLPEN: IO port F clock enable during Sleep mode
.equ  RCC_AHB1LPENR_GPIOFLPEN    ,0x00000020
.equ  RCC_AHB1LPENR_GPIOGLPEN_N  , 6 @ Bits 6 GPIOGLPEN: IO port G clock enable during Sleep mode
.equ  RCC_AHB1LPENR_GPIOGLPEN    ,0x00000040
.equ  RCC_AHB1LPENR_GPIOHLPEN_N  , 7 @ Bit 7 GPIOHLPEN: IO port H clock enable during Sleep mode
.equ  RCC_AHB1LPENR_GPIOHLPEN    ,0x00000080
.equ  RCC_AHB1LPENR_GPIOILPEN_N  , 8 @ Bit 8 GPIOILPEN: IO port I clock enable during Sleep mode
.equ  RCC_AHB1LPENR_GPIOILPEN    ,0x00000100
.equ  RCC_AHB1LPENR_GPIOHLPEN_N  , 9 @ Bit 9 GPIOJLPEN: IO port J clock enable during Sleep mode
.equ  RCC_AHB1LPENR_GPIOHLPEN    ,0x00000200
.equ  RCC_AHB1LPENR_GPIOILPEN_N  , 10 @ Bit 10 GPIOKLPEN: IO port K clock enable during Sleep mode
.equ  RCC_AHB1LPENR_GPIOILPEN    ,0x00000400
.equ  RCC_AHB1LPENR_CRCLPEN_N    , 12 @ Bit 12 CRCLPEN: CRC clock enable during Sleep mode
.equ  RCC_AHB1LPENR_CRCLPEN      ,0x00001000
.equ  RCC_AHB1LPENR_FLITFLPEN_N  , 15 @ Bit 15 FLITFLPEN: Flash interface clock enable during Sleep mode
.equ  RCC_AHB1LPENR_FLITFLPEN    ,0x00008000
.equ  RCC_AHB1LPENR_SRAM1LPEN_N  , 16 @ Bit 16 SRAM1LPEN: SRAM1 interface clock enable during Sleep mode
.equ  RCC_AHB1LPENR_SRAM1LPEN    ,0x00010000
.equ  RCC_AHB1LPENR_SRAM2LPEN_N  , 17 @ Bit 17 SRAM2LPEN: SRAM2 interface clock enable during Sleep mode
.equ  RCC_AHB1LPENR_SRAM2LPEN    ,0x00020000
.equ  RCC_AHB1LPENR_BKPSRAMLPEN_N, 18 @ Bit 18 BKPSRAMLPEN: Backup SRAM interface clock enable during Sleep mode
.equ  RCC_AHB1LPENR_BKPSRAMLPEN  ,0x00040000
.equ  RCC_AHB1LPENR_SRAM3LPEN_N  , 19 @ Bit 19 SRAM3LPEN: SRAM3 interface clock enable during Sleep mode
.equ  RCC_AHB1LPENR_SRAM3LPEN    ,0x00080000
.equ  RCC_AHB1LPENR_DMA1LPEN_N   , 21 @ Bit 21 DMA1LPEN: DMA1 clock enable during Sleep mode
.equ  RCC_AHB1LPENR_DMA1LPEN     ,0x00200000
.equ  RCC_AHB1LPENR_DMA2LPEN_N   , 22 @ Bit 22 DMA2LPEN: DMA2 clock enable during Sleep mode
.equ  RCC_AHB1LPENR_DMA2LPEN     ,0x00400000
.equ  RCC_AHB1LPENR_DMA2DPEN_N   , 23 @ Bit 23 DMA2DLPEN: DMA2D clock enable during Sleep mode
.equ  RCC_AHB1LPENR_DMA2DPEN     ,0x00800000
.equ  RCC_AHB1LPENR_ETHMACLPEN_N , 25 @ Bit 25 ETHMACLPEN: Ethernet MAC clock enable during Sleep mode
.equ  RCC_AHB1LPENR_ETHMACLPEN   ,0x02000000
.equ  RCC_AHB1LPENR_ETHMACTXLPEN_N, 26 @ Bit 26 ETHMACTXLPEN: Ethernet transmission clock enable during Sleep mode
.equ  RCC_AHB1LPENR_ETHMACTXLPEN ,0x04000000
.equ  RCC_AHB1LPENR_ETHMACRXLPEN_N, 27 @ Bit 27 ETHMACRXLPEN: Ethernet reception clock enable during Sleep mode
.equ  RCC_AHB1LPENR_ETHMACRXLPEN ,0x08000000
.equ  RCC_AHB1LPENR_ETHMACPTPLPEN_N, 28 @ Bit 28 ETHMACPTPLPEN: Ethernet PTP clock enable during Sleep mode
.equ  RCC_AHB1LPENR_ETHMACPTPLPEN,0x10000000
.equ  RCC_AHB1LPENR_OTGHSLPEN_N  , 29 @ Bit 29 OTGHSLPEN: USB OTG HS clock enable during Sleep mode
.equ  RCC_AHB1LPENR_OTGHSLPEN    ,0x20000000
.equ  RCC_AHB1LPENR_OTGHSULPILPEN_N, 30 @ Bit 30 OTGHSULPILPEN: USB OTG HS ULPI clock enable during Sleep mode
.equ  RCC_AHB1LPENR_OTGHSULPILPEN,0x40000000
@.end

@.item RCC_AHB2LPENR
.equ  RCC_AHB2LPENR_DCMILPEN_N   , 0 @ Bit 0 DCMILPEN: Camera interface enable during Sleep mode
.equ  RCC_AHB2LPENR_DCMILPEN     ,0x00000001
.equ  RCC_AHB2LPENR_CRYPLPEN_N   , 4 @ Bit 4 CRYPLPEN: Cryptography modules clock enable during Sleep mode
.equ  RCC_AHB2LPENR_CRYPLPEN     ,0x00000010
.equ  RCC_AHB2LPENR_HASHLPEN_N   , 5 @ Bit 5 HASHLPEN: Hash modules clock enable during Sleep mode
.equ  RCC_AHB2LPENR_HASHLPEN     ,0x00000020
.equ  RCC_AHB2LPENR_RNGLPEN_N    , 6 @ Bit 6 RNGLPEN: Random number generator clock enable during Sleep mode
.equ  RCC_AHB2LPENR_RNGLPEN      ,0x00000040
.equ  RCC_AHB2LPENR_OTGFSLPEN_N  , 7 @ Bit 7 OTGFSLPEN: USB OTG FS clock enable during Sleep mode
.equ  RCC_AHB2LPENR_OTGFSLPEN    ,0x00000080
@.end

@.item RCC_AHB3LPENR
.equ  RCC_AHB3LPENR_FSMCLPEN_N   , 0 @ FMCLPEN: Flexible memory controller module clock enable during Sleep mode
.equ  RCC_AHB3LPENR_FSMCLPEN     ,0x00000001
@.end

@.item RCC_APB1LPENR
.equ  RCC_APB1LPENR_TIM2LPEN_N   , 0 @ Bit 0 TIM2LPEN: TIM2 clock enable during Sleep mode
.equ  RCC_APB1LPENR_TIM2LPEN     ,0x00000001
.equ  RCC_APB1LPENR_TIM3LPEN_N   , 1 @ Bit 1 TIM3LPEN: TIM3 clock enable during Sleep mode
.equ  RCC_APB1LPENR_TIM3LPEN     ,0x00000002
.equ  RCC_APB1LPENR_TIM4LPEN_N   , 2 @ Bit 2 TIM4LPEN: TIM4 clock enable during Sleep mode
.equ  RCC_APB1LPENR_TIM4LPEN     ,0x00000004
.equ  RCC_APB1LPENR_TIM5LPEN_N   , 3 @ Bit 3 TIM5LPEN: TIM5 clock enable during Sleep mode
.equ  RCC_APB1LPENR_TIM5LPEN     ,0x00000008
.equ  RCC_APB1LPENR_TIM6LPEN_N   , 4 @ Bit 4 TIM6LPEN: TIM6 clock enable during Sleep mode
.equ  RCC_APB1LPENR_TIM6LPEN     ,0x00000010
.equ  RCC_APB1LPENR_TIM7LPEN_N   , 5 @ Bit 5 TIM7LPEN: TIM7 clock enable during Sleep mode
.equ  RCC_APB1LPENR_TIM7LPEN     ,0x00000020
.equ  RCC_APB1LPENR_TIM12LPEN_N  , 6 @ Bit 6 TIM12LPEN: TIM12 clock enable during Sleep mode
.equ  RCC_APB1LPENR_TIM12LPEN    ,0x00000040
.equ  RCC_APB1LPENR_TIM13LPEN_N  , 7 @ Bit 7 TIM13LPEN: TIM13 clock enable during Sleep mode
.equ  RCC_APB1LPENR_TIM13LPEN    ,0x00000080
.equ  RCC_APB1LPENR_TIM14LPEN_N  , 8 @ Bit 8 TIM14LPEN: TIM14 clock enable during Sleep mode
.equ  RCC_APB1LPENR_TIM14LPEN    ,0x00000100
.equ  RCC_APB1LPENR_WWDGLPEN_N   , 11 @ Bit 11 WWDGLPEN: Window watchdog clock enable during Sleep mode
.equ  RCC_APB1LPENR_WWDGLPEN     ,0x00000800
.equ  RCC_APB1LPENR_SPI2LPEN_N   , 14 @ Bit 14 SPI2LPEN: SPI2 clock enable during Sleep mode
.equ  RCC_APB1LPENR_SPI2LPEN     ,0x00004000
.equ  RCC_APB1LPENR_SPI3LPEN_N   , 15 @ Bit 15 SPI3LPEN: SPI3 clock enable during Sleep mode
.equ  RCC_APB1LPENR_SPI3LPEN     ,0x00008000
.equ  RCC_APB1LPENR_USART2LPEN_N , 17 @ Bit 17 USART2LPEN: USART2 clock enable during Sleep mode
.equ  RCC_APB1LPENR_USART2LPEN   ,0x00020000
.equ  RCC_APB1LPENR_USART3LPEN_N , 18 @ Bit 18 USART3LPEN: USART3 clock enable during Sleep mode
.equ  RCC_APB1LPENR_USART3LPEN   ,0x00040000
.equ  RCC_APB1LPENR_UART4LPEN_N  , 19 @ Bit 19 UART4LPEN: UART4 clock enable during Sleep mode
.equ  RCC_APB1LPENR_UART4LPEN    ,0x00080000
.equ  RCC_APB1LPENR_UART5LPEN_N  , 20 @ Bit 20 UART5LPEN: UART5 clock enable during Sleep mode
.equ  RCC_APB1LPENR_UART5LPEN    ,0x00100000
.equ  RCC_APB1LPENR_I2C1LPEN_N   , 21 @ Bit 21 I2C1LPEN: I2C1 clock enable during Sleep mode
.equ  RCC_APB1LPENR_I2C1LPEN     ,0x00200000
.equ  RCC_APB1LPENR_I2C2LPEN_N   , 22 @ Bit 22 I2C2LPEN: I2C2 clock enable during Sleep mode
.equ  RCC_APB1LPENR_I2C2LPEN     ,0x00400000
.equ  RCC_APB1LPENR_I2C3LPEN_N   , 23 @ Bit 23 I2C3LPEN: I2C3 clock enable during Sleep mode
.equ  RCC_APB1LPENR_I2C3LPEN     ,0x00800000
.equ  RCC_APB1LPENR_CAN1LPEN_N   , 25 @ Bit 25 CAN1LPEN: CAN 1 clock enable during Sleep mode
.equ  RCC_APB1LPENR_CAN1LPEN     ,0x02000000
.equ  RCC_APB1LPENR_CAN2LPEN_N   , 26 @ Bit 26 CAN2LPEN: CAN 2 clock enable during Sleep mode
.equ  RCC_APB1LPENR_CAN2LPEN     ,0x04000000
.equ  RCC_APB1LPENR_PWRLPEN_N    , 28 @ Bit 28 PWRLPEN: Power interface clock enable during Sleep mode
.equ  RCC_APB1LPENR_PWRLPEN      ,0x10000000
.equ  RCC_APB1LPENR_DACLPEN_N    , 29 @ Bit 29 DACLPEN: DAC interface clock enable during Sleep mode
.equ  RCC_APB1LPENR_DACLPEN      ,0x20000000
.equ  RCC_APB1LPENR_UART7LPEN_N  , 30 @ Bit 30 UART7LPEN: UART7 clock enable during Sleep mode
.equ  RCC_APB1LPENR_UART7LPEN    ,0x40000000
.equ  RCC_APB1LPENR_UART8LPEN_N  , 31 @ Bit 31 UART8LPEN: UART8 clock enable during Sleep mode
.equ  RCC_APB1LPENR_UART8LPEN    ,0x80000000
@.end

@.item RCC_APB2LPENR
.equ  RCC_APB2LPENR_TIM1LPEN_N   , 0 @ Bit 0 TIM1LPEN: TIM1 clock enable during Sleep mode
.equ  RCC_APB2LPENR_TIM1LPEN     ,0x00000001
.equ  RCC_APB2LPENR_TIM8LPEN_N   , 1 @ Bit 1 TIM8LPEN: TIM8 clock enable during Sleep mode
.equ  RCC_APB2LPENR_TIM8LPEN     ,0x00000002
.equ  RCC_APB2LPENR_USART1LPEN_N , 4 @ Bit 4 USART1LPEN: USART1 clock enable during Sleep mode
.equ  RCC_APB2LPENR_USART1LPEN   ,0x00000010
.equ  RCC_APB2LPENR_USART6LPEN_N , 5 @ Bit 5 USART6LPEN: USART6 clock enable during Sleep mode
.equ  RCC_APB2LPENR_USART6LPEN   ,0x00000020
.equ  RCC_APB2LPENR_ADC1LPEN_N   , 8 @ Bit 8 ADC1LPEN: ADC1 clock enable during Sleep mode
.equ  RCC_APB2LPENR_ADC1LPEN     ,0x00000100
.equ  RCC_APB2LPENR_ADC2PEN_N    , 9 @ Bit 9 ADC2LPEN: ADC2 clock enable during Sleep mode
.equ  RCC_APB2LPENR_ADC2PEN      , 0x00000200
.equ  RCC_APB2LPENR_ADC3LPEN_N   , 10 @ Bit 10 ADC3LPEN: ADC 3 clock enable during Sleep mode
.equ  RCC_APB2LPENR_ADC3LPEN     , 0x00000400
.equ  RCC_APB2LPENR_SDIOLPEN_N   , 11 @ Bit 11 SDIOLPEN: SDIO clock enable during Sleep mode
.equ  RCC_APB2LPENR_SDIOLPEN     , 0x00000800
.equ  RCC_APB2LPENR_SPI1LPEN_N   , 12 @ Bit 12 SPI1LPEN: SPI1 clock enable during Sleep mode
.equ  RCC_APB2LPENR_SPI1LPEN     , 0x00001000
.equ  RCC_APB2LPENR_SPI4LPEN_N   , 13 @ Bit 13 SPI4LPEN: SPI4 clock enable during Sleep mode
.equ  RCC_APB2LPENR_SPI4LPEN     ,0x00002000
.equ  RCC_APB2LPENR_SYSCFGLPEN_N , 14 @ Bit 14 SYSCFGLPEN: System configuration controller clock enable during Sleep mode
.equ  RCC_APB2LPENR_SYSCFGLPEN   ,0x00004000
.equ  RCC_APB2LPENR_TIM9LPEN_N   , 16 @ Bit 16 TIM9LPEN: TIM9 clock enable during sleep mode
.equ  RCC_APB2LPENR_TIM9LPEN     ,0x00010000
.equ  RCC_APB2LPENR_TIM10LPEN_N  , 17 @ Bit 17 TIM10LPEN: TIM10 clock enable during Sleep mode
.equ  RCC_APB2LPENR_TIM10LPEN    ,0x00020000
.equ  RCC_APB2LPENR_TIM11LPEN_N  , 18 @ Bit 18 TIM11LPEN: TIM11 clock enable during Sleep mode
.equ  RCC_APB2LPENR_TIM11LPEN    ,0x00040000
.equ  RCC_APB2LPENR_SPI5LPEN_N   , 20 @ Bit 20 SPI5LPEN: SPI5 clock enable during Sleep mode
.equ  RCC_APB2LPENR_SPI5LPEN     ,0x00100000
.equ  RCC_APB2LPENR_SPI6LPEN_N   , 21 @ Bit 21 SPI6LPEN: SPI6 clock enable during Sleep mode
.equ  RCC_APB2LPENR_SPI6LPEN     ,0x00200000
.equ  RCC_APB2LPENR_SAI1LPEN_N   , 22 @ Bit 22 SAI1LPEN: SAI1 clock enable during Sleep mode
.equ  RCC_APB2LPENR_SAI1LPEN     ,0x00400000
.equ  RCC_APB2LPENR_LTDCLPEN_N   , 26 @ Bit 26 LTDCLPEN: LTDC clock enable during Sleep mode
.equ  RCC_APB2LPENR_LTDCLPEN     ,0x04000000
@.end

@.item RCC_BDCR
.equ  RCC_BDCR_LSEON_N           , 0 @ Bit 0 LSEON: External low-speed oscillator enable
.equ  RCC_BDCR_LSEON             ,0x00000001
.equ  RCC_BDCR_LSERDY_N          , 1 @ Bit 1 LSERDY: External low-speed oscillator ready
.equ  RCC_BDCR_LSERDY            ,0x00000002
.equ  RCC_BDCR_LSEBYP_N          , 2 @ Bit 2 LSEBYP: External low-speed oscillator bypass
.equ  RCC_BDCR_LSEBYP            ,0x00000004
.equ  RCC_BDCR_RTCSEL_NO_CLOCK   , 0x00<<8 @ Bits 9:8 RTCSEL[1:0]: RTC clock source selection
.equ  RCC_BDCR_RTCSEL_LSE        , 0x01<<8
.equ  RCC_BDCR_RTCSEL_LSI        , 0x02<<8
.equ  RCC_BDCR_RTCSEL_HSE        , 0x03<<8
.equ  RCC_BDCR_RTCEN_N           , 15 @ Bit 15 RTCEN: RTC clock enable
.equ  RCC_BDCR_RTCEN             ,0x00008000
.equ  RCC_BDCR_BDRST_N           ,16 @ Bit 16 BDRST: Backup domain software reset
.equ  RCC_BDCR_BDRST             ,0x00010000
@.end

@.item RCC_CSR
.equ  RCC_CSR_LSION_N            , 0 @ Bit 0 LSION: Internal low-speed oscillator enable
.equ  RCC_CSR_LSION              ,0x00000001
.equ  RCC_CSR_LSIRDY_N           , 1 @ Bit 1 LSIRDY: Internal low-speed oscillator ready
.equ  RCC_CSR_LSIRDY             ,0x00000002
.equ  RCC_CSR_RMVF_N             , 24 @ Bit 24 RMVF: Remove reset flag
.equ  RCC_CSR_RMVF               ,0x01000000
.equ  RCC_CSR_BORRSTF_N          , 25 @ Bit 25 BORRSTF: BOR reset flag
.equ  RCC_CSR_BORRSTF            ,0x02000000
.equ  RCC_CSR_PADRSTF_N          , 26 @ Bit 26 PINRSTF: PIN reset flag
.equ  RCC_CSR_PADRSTF            ,0x04000000
.equ  RCC_CSR_PORRSTF_N          , 27 @ Bit 27 PORRSTF: POR/PDR reset flag
.equ  RCC_CSR_PORRSTF            ,0x08000000
.equ  RCC_CSR_SFTRSTF_N          , 28 @ Bit 28 SFTRSTF: Software reset flag
.equ  RCC_CSR_SFTRSTF            ,0x10000000
.equ  RCC_CSR_WDGRSTF_N          , 29 @ Bit 29 IWDGRSTF: Independent watchdog reset flag
.equ  RCC_CSR_WDGRSTF            ,0x20000000
.equ  RCC_CSR_WWDGRSTF_N         , 30 @ Bit 30 WWDGRSTF: Window watchdog reset flag
.equ  RCC_CSR_WWDGRSTF           ,0x40000000
.equ  RCC_CSR_LPWRRSTF_N         , 31 @Bit 31 LPWRRSTF: Low-power reset flag
.equ  RCC_CSR_LPWRRSTF           ,0x80000000
@.end

