gorbukov/AsmEdit4/inf/STM32/MCU/STM32F4/PERIPH/RCC/rcc.inc
@.item RCC_SSCGR
.equ  RCC_SSCGR_MODPER_N         , 0 @ Bits 12:0 MODPER: Modulation period
.equ  RCC_SSCGR_INCSTEP_N        , 13 @ Bits 27:13 INCSTEP: Incrementation step
.equ  RCC_SSCGR_SPREADSEL_DOWN   ,0x40000000 @ Bit 30 SPREADSEL: Spread Select
.equ  RCC_SSCGR_SPREADSEL_CENTER ,0x00000000
.equ  RCC_SSCGR_SSCGEN_N         , 31 @ Bit 31 SSCGEN: Spread spectrum modulation enable
.equ  RCC_SSCGR_SSCGEN           ,0x80000000
@.end

@.item RCC_PLLI2SCFGR
.equ  RCC_PLLI2SCFGR_PLLI2SN_N   , 6 @ Bits 14:6 PLLI2SN: PLLI2S multiplication factor for VCO (2..432; 434..510)
.equ  RCC_PLLI2SCFGR_PLLI2SQ_2   , 0x02<<24 @ Bits 27:24 PLLI2SQ: PLLI2S division factor for SAI1 clock
.equ  RCC_PLLI2SCFGR_PLLI2SQ_3   , 0x03<<24
.equ  RCC_PLLI2SCFGR_PLLI2SQ_4   , 0x04<<24
.equ  RCC_PLLI2SCFGR_PLLI2SQ_5   , 0x05<<24
.equ  RCC_PLLI2SCFGR_PLLI2SQ_6   , 0x06<<24
.equ  RCC_PLLI2SCFGR_PLLI2SQ_7   , 0x07<<24
.equ  RCC_PLLI2SCFGR_PLLI2SQ_8   , 0x08<<24
.equ  RCC_PLLI2SCFGR_PLLI2SQ_9   , 0x09<<24
.equ  RCC_PLLI2SCFGR_PLLI2SQ_10  , 10<<24
.equ  RCC_PLLI2SCFGR_PLLI2SQ_11  , 11<<24
.equ  RCC_PLLI2SCFGR_PLLI2SQ_12  , 12<<24
.equ  RCC_PLLI2SCFGR_PLLI2SQ_13  , 13<<24
.equ  RCC_PLLI2SCFGR_PLLI2SQ_14  , 14<<24
.equ  RCC_PLLI2SCFGR_PLLI2SQ_15  , 15<<24
.equ  RCC_PLLI2SCFGR_PLLI2SR_PLLR_2, 0x02<<28 @ Bits 30:28 PLLI2SR: PLLI2S division factor for I2S clocks
.equ  RCC_PLLI2SCFGR_PLLI2SR_PLLR_3, 0x03<<28
.equ  RCC_PLLI2SCFGR_PLLI2SR_PLLR_4, 0x04<<28
.equ  RCC_PLLI2SCFGR_PLLI2SR_PLLR_5, 0x05<<28
.equ  RCC_PLLI2SCFGR_PLLI2SR_PLLR_6, 0x06<<28
.equ  RCC_PLLI2SCFGR_PLLI2SR_PLLR_7, 0x07<<28
@.end

@.item RCC_PLLSAICFGR
.equ  RCC_PLLSAICFGR_PLLSAIR_2     , 2<<28 @ Bits 30:28 PLLSAIR: PLLSAI division factor for LCD clock
.equ  RCC_PLLSAICFGR_PLLSAIR_3     , 3<<28
.equ  RCC_PLLSAICFGR_PLLSAIR_4     , 4<<28
.equ  RCC_PLLSAICFGR_PLLSAIR_5     , 5<<28
.equ  RCC_PLLSAICFGR_PLLSAIR_6     , 6<<28
.equ  RCC_PLLSAICFGR_PLLSAIR_7     , 7<<28
.equ  RCC_PLLSAICFGR_PLLSAIQ_2     , 2<<24 @ Bits 27:24 PLLSAIQ: PLLSAI division factor for SAI1 clock
.equ  RCC_PLLSAICFGR_PLLSAIQ_3     , 3<<24
.equ  RCC_PLLSAICFGR_PLLSAIQ_4     , 4<<24
.equ  RCC_PLLSAICFGR_PLLSAIQ_5     , 5<<24
.equ  RCC_PLLSAICFGR_PLLSAIQ_6     , 6<<24
.equ  RCC_PLLSAICFGR_PLLSAIQ_7     , 7<<24
.equ  RCC_PLLSAICFGR_PLLSAIQ_8     , 8<<24
.equ  RCC_PLLSAICFGR_PLLSAIQ_9     , 9<<24
.equ  RCC_PLLSAICFGR_PLLSAIQ_10     , 10<<24
.equ  RCC_PLLSAICFGR_PLLSAIQ_11     , 11<<24
.equ  RCC_PLLSAICFGR_PLLSAIQ_12     , 12<<24
.equ  RCC_PLLSAICFGR_PLLSAIQ_13     , 13<<24
.equ  RCC_PLLSAICFGR_PLLSAIQ_14     , 14<<24
.equ  RCC_PLLSAICFGR_PLLSAIQ_15     , 15<<24
.equ  RCC_PLLSAICFGR_PLLSAIN_N     , 6 @ Bits 14:6 PLLSAIN: PLLSAI division factor for VCO (2..432; 434..510)
@.end

@.item RCC_DCKCFGR
.equ  RCC_DCKCFGR_TIMPRE_0           ,0 @ Bit 24  TIMPRE: Timers clocks prescalers selection
.equ  RCC_DCKCFGR_TIMPRE_1           ,1<<24
.equ  RCC_DCKCFGR_SAI1ASRC_PLLSAI_Q_DIV_PLLSAIDIVQ  ,0<<20 @ Bits 23:22 SAI1BSRC: SAI1-B clock source selection
.equ  RCC_DCKCFGR_SAI1ASRC_PLLI2S_Q_DIV_PLLI2SDIVQ  ,1<<20
.equ  RCC_DCKCFGR_SAI1ASRC_ALTERNATE_INPUT            ,2<<20
.equ  RCC_DCKCFGR_SAI1BSRC_PLLSAI_Q_DIV_PLLSAIDIVQ  ,0<<20 @ Bits 21:20 SAI1ASRC: SAI1-A clock source selection
.equ  RCC_DCKCFGR_SAI1BSRC_PLLI2S_Q_DIV_PLLI2SDIVQ  ,1<<20
.equ  RCC_DCKCFGR_SAI1BSRC_ALTERNATE_INPUT            ,2<<20
.equ  RCC_DCKCFGR_PLLSAIDIVR_DIV_2, 0<<16 @ Bits 17:16 PLLSAIDIVR: division factor for LCD_CLK
.equ  RCC_DCKCFGR_PLLSAIDIVR_DIV_4, 1<<16
.equ  RCC_DCKCFGR_PLLSAIDIVR_DIV_8, 2<<16
.equ  RCC_DCKCFGR_PLLSAIDIVR_DIV_16, 3<<16
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_1, 0<<8 @ Bits 12:8 PLLSAIDIVQ: PLLSAI division factor for SAI1 clock
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_2, 1<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_3, 2<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_4, 3<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_5, 4<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_6, 5<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_7, 6<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_8, 7<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_9, 8<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_10, 9<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_11, 10<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_12, 11<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_13, 12<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_14, 13<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_15, 14<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_16, 15<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_17, 16<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_18, 17<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_19, 18<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_20, 19<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_21, 20<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_22, 21<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_23, 22<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_24, 23<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_25, 24<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_26, 25<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_27, 26<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_28, 27<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_29, 28<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_30, 29<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_31, 30<<8
.equ  RCC_DCKCFGR_PLLSAIDIVQ_DIV_32, 31<<8
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_1, 0 @ Bits 4:0 PLLI2SDIVQ: PLLI2S division factor for SAI1 clock
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_2, 1
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_3, 2
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_4, 3
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_5, 4
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_6, 5
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_7, 6
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_8, 7
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_9, 8
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_10, 9
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_11, 10
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_12, 11
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_13, 12
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_14, 13
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_15, 14
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_16, 15
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_17, 16
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_18, 17
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_19, 18
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_20, 19
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_21, 20
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_22, 21
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_23, 22
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_24, 23
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_25, 24
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_26, 25
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_27, 26
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_28, 27
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_29, 28
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_30, 29
.equ  RCC_DCKCFGR_PLLI2SDIVQ_DIV_31, 30
